In [1]:
# Python Week 4 Class Notes

In [3]:
import pandas as pd
import numpy as np

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [5]:
# Converting to a series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
# Using NumPy Arrays
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
# From a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
# Data in a series

In [12]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [13]:
# Functions can be put into a Pandas Series
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [14]:
# Create a new series
series1 = pd.Series([1,2,3,4], index=['USA','Germany','Russia','Japan'])

In [15]:
series1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [16]:
series2 = pd.Series([1,2,3,4], index=['USA','Germany','Italy','Japan'])

In [17]:
series2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
series1['USA']

1

In [19]:
series2['Germany']

2

In [20]:
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

In [21]:
df = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]});df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [26]:
df = pd.DataFrame(np.random.randn(5,4),
                  index=['A','B','C','D','E'],
                  columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405
E  0.831273  0.239293  0.548413 -0.343689

In [27]:
df['W']

A   -0.280389
B    0.727749
C    1.374020
D   -0.677710
E    0.831273
Name: W, dtype: float64

In [28]:
df[['W','Z']]

          W         Z
A -0.280389 -0.584959
B  0.727749  0.183714
C  1.374020 -1.803810
D -0.677710 -0.141405
E  0.831273 -0.343689

In [29]:
# Similar to the '$' in R, pandas Dataframes can use '.'
df.W

A   -0.280389
B    0.727749
C    1.374020
D   -0.677710
E    0.831273
Name: W, dtype: float64

In [30]:
type(df['W'])

pandas.core.series.Series

In [37]:
# Creating a new column
df['new'] = df['W'] + df['Y'];df

          W         X         Y         Z       new
A -0.280389 -0.240078  0.379135 -0.584959  0.098746
B  0.727749  1.363878 -1.135411  0.183714 -0.407662
C  1.374020 -1.029939 -0.245683 -1.803810  1.128338
D -0.677710 -1.386176  0.401563 -0.141405 -0.276147
E  0.831273  0.239293  0.548413 -0.343689  1.379686

In [40]:
# deleting columns 

# --> Axis (Row=0, Col=1)

df.drop('new',axis=1)

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405
E  0.831273  0.239293  0.548413 -0.343689

In [41]:
# note that it's not permanent deletion
df

          W         X         Y         Z       new
A -0.280389 -0.240078  0.379135 -0.584959  0.098746
B  0.727749  1.363878 -1.135411  0.183714 -0.407662
C  1.374020 -1.029939 -0.245683 -1.803810  1.128338
D -0.677710 -1.386176  0.401563 -0.141405 -0.276147
E  0.831273  0.239293  0.548413 -0.343689  1.379686

In [45]:
# For permanent deletion, use inplace=TRUE

df.drop('new',axis=1,inplace=True);df

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405
E  0.831273  0.239293  0.548413 -0.343689

In [46]:
# Drop rows using axis=0
df.drop('E', axis=0)

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405

In [47]:
# INDEXING IN PYTHON

# LOC  -> uses names

# n'

# ILOC -> uses positions

In [55]:
df

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405
E  0.831273  0.239293  0.548413 -0.343689

In [48]:
df.loc['A']

W   -0.280389
X   -0.240078
Y    0.379135
Z   -0.584959
Name: A, dtype: float64

In [54]:
df.iloc[0]

W   -0.280389
X   -0.240078
Y    0.379135
Z   -0.584959
Name: A, dtype: float64

In [57]:
# Selecting a subset of rows and columns
df.loc['B','Y']

-1.1354106819783552

In [58]:
# Use bracket notation [Rows][Columnns] to multi-index
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.280389  0.379135
B  0.727749 -1.135411

In [60]:
df

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405
E  0.831273  0.239293  0.548413 -0.343689

In [61]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B   True   True  False   True
C   True  False  False  False
D  False  False   True  False
E   True   True   True  False

In [62]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN  0.379135       NaN
B  0.727749  1.363878       NaN  0.183714
C  1.374020       NaN       NaN       NaN
D       NaN       NaN  0.401563       NaN
E  0.831273  0.239293  0.548413       NaN

In [63]:
df[df['W'] > 0]

          W         X         Y         Z
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
E  0.831273  0.239293  0.548413 -0.343689

In [64]:
df[df['W'] > 0]['Y']

B   -1.135411
C   -0.245683
E    0.548413
Name: Y, dtype: float64

In [65]:
df[df['W'] > 0][['Y','X']]

          Y         X
B -1.135411  1.363878
C -0.245683 -1.029939
E  0.548413  0.239293

In [66]:
#Similar to R, mulitple conditions can be subset from a Pandas Dataframe using the & (and) and | (or) operators

In [71]:
df

          W         X         Y         Z
A -0.280389 -0.240078  0.379135 -0.584959
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
D -0.677710 -1.386176  0.401563 -0.141405
E  0.831273  0.239293  0.548413 -0.343689

In [70]:
#AND
df[(df['W'] > 0) & (df['Y'] < 0)]

          W         X         Y         Z
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810

In [72]:
#OR
df[(df['W'] > 0) | (df['Y'] < 0)]

          W         X         Y         Z
B  0.727749  1.363878 -1.135411  0.183714
C  1.374020 -1.029939 -0.245683 -1.803810
E  0.831273  0.239293  0.548413 -0.343689

In [73]:
# Reset to default 0, 1,...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.280389 -0.240078  0.379135 -0.584959
1     B  0.727749  1.363878 -1.135411  0.183714
2     C  1.374020 -1.029939 -0.245683 -1.803810
3     D -0.677710 -1.386176  0.401563 -0.141405
4     E  0.831273  0.239293  0.548413 -0.343689

In [76]:
new_index = 'CA NY WY OR CO'.split() #split() by default split by spaces, but can be specified by split(sep=)

# easier equivalent to
# new_index = ['CA','NY','WY','OR','CO']

In [77]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [80]:
df['States'] = new_index;df

          W         X         Y         Z States
A -0.280389 -0.240078  0.379135 -0.584959     CA
B  0.727749  1.363878 -1.135411  0.183714     NY
C  1.374020 -1.029939 -0.245683 -1.803810     WY
D -0.677710 -1.386176  0.401563 -0.141405     OR
E  0.831273  0.239293  0.548413 -0.343689     CO

In [81]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.280389 -0.240078  0.379135 -0.584959
NY      0.727749  1.363878 -1.135411  0.183714
WY      1.374020 -1.029939 -0.245683 -1.803810
OR     -0.677710 -1.386176  0.401563 -0.141405
CO      0.831273  0.239293  0.548413 -0.343689

In [82]:
df

          W         X         Y         Z States
A -0.280389 -0.240078  0.379135 -0.584959     CA
B  0.727749  1.363878 -1.135411  0.183714     NY
C  1.374020 -1.029939 -0.245683 -1.803810     WY
D -0.677710 -1.386176  0.401563 -0.141405     OR
E  0.831273  0.239293  0.548413 -0.343689     CO

In [83]:
df.set_index('States',inplace=True);df

               W         X         Y         Z
States
CA     -0.280389 -0.240078  0.379135 -0.584959
NY      0.727749  1.363878 -1.135411  0.183714
WY      1.374020 -1.029939 -0.245683 -1.803810
OR     -0.677710 -1.386176  0.401563 -0.141405
CO      0.831273  0.239293  0.548413 -0.343689

In [ ]:
# Hierarchical dataframes

In [84]:
# Hierarchy Multi-indexed dataframes
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # it's a tuple
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [85]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [86]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1 -0.897409  0.210579
   2 -0.476640 -0.197093
   3  0.766737  1.236160
G2 1 -0.864992 -1.479506
   2  1.058177 -0.274171
   3  0.783781  0.611199

In [87]:
df.loc['G1']

          A         B
1 -0.897409  0.210579
2 -0.476640 -0.197093
3  0.766737  1.236160

In [88]:
df.loc['G1'].loc[1]

A   -0.897409
B    0.210579
Name: 1, dtype: float64

In [89]:
#attributing names for index
df.index.names

FrozenList([None, None])

In [90]:
df.index.names = ['Group','Num']

In [91]:
df

                  A         B
Group Num
G1    1   -0.897409  0.210579
      2   -0.476640 -0.197093
      3    0.766737  1.236160
G2    1   -0.864992 -1.479506
      2    1.058177 -0.274171
      3    0.783781  0.611199

In [92]:
# method to not use .loc two times

# xs()

df.xs('G1')

            A         B
Num
1   -0.897409  0.210579
2   -0.476640 -0.197093
3    0.766737  1.236160

In [94]:
df.xs(['G1',1])

A   -0.897409
B    0.210579
Name: (G1, 1), dtype: float64

In [97]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.897409  0.210579
G2    -0.864992 -1.479506

In [98]:
df.xs(2,level='Num')

              A         B
Group
G1    -0.476640 -0.197093
G2     1.058177 -0.274171

In [ ]:
# Missing Data